#Область ШлюзПодписокНаСобытия

#Область ШлюзПодписокНаСобытия_Документы

Процедура Документы_ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.ОбратнаяСвязь") Тогда
		Документ_ОбратнаяСвязь_ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);	
	КонецЕсли;

КонецПроцедуры

Процедура Документы_ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт

	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.Заявка") Тогда
		Документ_Заявка_ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

Процедура Документы_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.Заявка") Тогда
		Документ_Заявка_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОказаниеУслуг") Тогда
		Документ_ОказаниеУслуг_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		Документ_ПриходныйКассовыйОрдер_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		Документ_РасходныйКассовыйОрдер_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОплатаПлатежнойКартой") Тогда
		Документ_ОплатаПлатежнойКартой_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВозвратПоПлатежнойКарте") Тогда
		Документ_ВозвратПоПлатежнойКарте_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
		Документ_ПлатежноеПоручениеВходящее_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
		Документ_ПлатежноеПоручениеИсходящее_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЛистокНетрудоспособности") Тогда
		Документ_ЛистокНетрудоспособности_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);	
	КонецЕсли;

КонецПроцедуры

Процедура Документы_ПриЗаписи(Источник, Отказ) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.ЛистОжидания") Тогда 
		Документ_ЛистОжидание_ПриЗаписи(Источник, Отказ);  
	КонецЕсли;

КонецПроцедуры

Процедура Документы_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.ОказаниеУслуг") Тогда
		Документ_ОказаниеУслуг_ОбработкаПроведения(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.НачислениеЗарплаты") Тогда
		Документ_НачислениеЗарплаты_ОбработкаПроведения(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Прием") Тогда
		Документ_Прием_ОбработкаПроведения(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.СписаниеБонусов") Тогда
		Документ_СписаниеБонусов_ОбработкаПроведения(Источник, Отказ, РежимПроведения);
	КонецЕсли;

КонецПроцедуры

Процедура Документы_ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.ОказаниеУслуг") Тогда
		Документ_ОказаниеУслуг_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		Документ_ПриходныйКассовыйОрдер_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		Документ_РасходныйКассовыйОрдер_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ОплатаПлатежнойКартой") Тогда
		Документ_ОплатаПлатежнойКартой_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ВозвратПоПлатежнойКарте") Тогда
		Документ_ВозвратПоПлатежнойКарте_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
		Документ_ПлатежноеПоручениеВходящее_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
		Документ_ПлатежноеПоручениеИсходящее_ОбработкаУдаленияПроведения(Источник, Отказ);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Прием") Тогда
		Документ_Прием_ОбработкаУдаленияПроведения(Источник, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура Документы_ПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("ДокументОбъект.ОказаниеУслуг") Тогда
		Документ_ОказаниеУслуг_ПриКопировании(Источник, ОбъектКопирования); 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ШлюзПодписокНаСобытия_Справочники

Процедура Справочники_ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("СправочникОбъект.Клиенты") Тогда
		Справочник_Клиенты_ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты);	
	КонецЕсли;
	
КонецПроцедуры

Процедура Справочники_ПередЗаписью(Источник, Отказ) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	Если ТипОбъекта = Тип("СправочникОбъект.ВидыПолисов") Тогда
		Справочник_ВидыПолисов_ПередЗаписью(Источник, Отказ);	
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#КонецОбласти     

#Область ПодпискиНаСобытия_Документы

#Область Документы_ОбработкаЗаполнения

Процедура Документ_ОбратнаяСвязь_ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область Документы_ОбработкаПроверкиЗаполнения

Процедура Документ_Заявка_ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

#КонецОбласти

#Область Документы_ПередЗаписью

Процедура Документ_ОказаниеУслуг_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	
КонецПроцедуры

Процедура Документ_Заявка_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)		
	
КонецПроцедуры

Процедура Документ_ПриходныйКассовыйОрдер_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура Документ_РасходныйКассовыйОрдер_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура Документ_ОплатаПлатежнойКартой_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура Документ_ВозвратПоПлатежнойКарте_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура Документ_ПлатежноеПоручениеВходящее_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура Документ_ПлатежноеПоручениеИсходящее_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
КонецПроцедуры

Процедура Документ_ЛистокНетрудоспособности_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения)
	
	
КонецПроцедуры

#КонецОбласти 

#Область Документы_ПриЗаписи

Процедура Документ_ЛистОжидание_ПриЗаписи(Источник, Отказ)
	
	
КонецПроцедуры

#КонецОбласти 

#Область Документы_ОбработкаПроведения

Процедура Документ_ОказаниеУслуг_ОбработкаПроведения(Источник, Отказ, РежимПроведения)		
	
		
КонецПроцедуры

Процедура Документ_Прием_ОбработкаПроведения(Источник, Отказ, РежимПроведения)
    
КонецПроцедуры

Процедура Документ_НачислениеЗарплаты_ОбработкаПроведения(Источник, Отказ, РежимПроведения)		
	
		
КонецПроцедуры

Процедура Документ_СписаниеБонусов_ОбработкаПроведения(Источник, Отказ, РежимПроведения)

	
КонецПроцедуры

#КонецОбласти

#Область Документы_ОбработкаУдаленияПроведения

Процедура Документ_ОказаниеУслуг_ОбработкаУдаленияПроведения(Источник, Отказ)
	
	
КонецПроцедуры

Процедура Документ_ПриходныйКассовыйОрдер_ОбработкаУдаленияПроведения(Источник, Отказ)
	
КонецПроцедуры

Процедура Документ_РасходныйКассовыйОрдер_ОбработкаУдаленияПроведения(Источник, Отказ)
	
КонецПроцедуры

Процедура Документ_ОплатаПлатежнойКартой_ОбработкаУдаленияПроведения(Источник, Отказ)
	
КонецПроцедуры

Процедура Документ_ВозвратПоПлатежнойКарте_ОбработкаУдаленияПроведения(Источник, Отказ)
	
КонецПроцедуры

Процедура Документ_ПлатежноеПоручениеВходящее_ОбработкаУдаленияПроведения(Источник, Отказ)
	
КонецПроцедуры

Процедура Документ_ПлатежноеПоручениеИсходящее_ОбработкаУдаленияПроведения(Источник, Отказ)
	
КонецПроцедуры

Процедура Документ_Прием_ОбработкаУдаленияПроведения(Источник, Отказ)

КонецПроцедуры

#КонецОбласти

#Область Документы_ПриКопировании

Процедура Документ_ОказаниеУслуг_ПриКопировании(Источник, ОбъектКопирования)
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти  

#Область ПодпискиНаСобытия_Справочники

#Область Справочники_ОбработкаПроверкиЗаполнения

Процедура Справочник_Клиенты_ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

#КонецОбласти  

Процедура Справочник_ВидыПолисов_ПередЗаписью(Источник, Отказ)

	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции


#КонецОбласти






