
#Область ШлюзПодписокНаСобытия

Процедура ПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт

	ТипОбъекта = ТипЗнч(Источник);
	
КонецПроцедуры

Процедура ПередЗаписью(Источник, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);

КонецПроцедуры

Процедура ПриЗаписи(Источник, Отказ) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);

КонецПроцедуры

Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипОбъекта = ТипЗнч(Источник);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт

	ТипОбъекта = ТипЗнч(Источник);
	
КонецПроцедуры

#КонецОбласти 
   
#Область ДополнительныеПроцедурыИФункции


#КонецОбласти


























#Область ПодпискиНаСобытия_Документы

#Область Документы_ОбработкаЗаполнения


#КонецОбласти

#Область Документы_ОбработкаПроверкиЗаполнения


#КонецОбласти

#Область Документы_ПередЗаписью


#КонецОбласти 

#Область Документы_ПриЗаписи


#КонецОбласти 

#Область Документы_ОбработкаПроведения


#КонецОбласти

#Область Документы_ОбработкаУдаленияПроведения


#КонецОбласти

#Область Документы_ПриКопировании


#КонецОбласти

#КонецОбласти  

#Область ПодпискиНаСобытия_Справочники

#Область Справочники_ОбработкаПроверкиЗаполнения


#КонецОбласти  


#КонецОбласти








