#Область ПрограммныйИнтерфейс

Функция ПолучитьПростуюНастройкуУчета(ИмяНастройки, СообщитьОНезаполненном = Ложь, Отказ = Ложь) Экспорт
	Настройка = Справочники.бит_НастройкиУчета[ИмяНастройки];
	Значение = Настройка.Значение;	
	Если СообщитьОНезаполненном И НЕ ЗначениеЗаполнено(Значение) Тогда
		Наименование = Настройка.Наименование;
		ОбщегоНазначения.СообщитьОбОшибке("Настрока учета " + Наименование + " - не заполнена.", Отказ);
	КонецЕсли;
	Возврат Значение;
КонецФункции

Функция ПолучитьНастройкуУчета(ИмяНастройки, Реквизит) Экспорт
	Возврат Справочники.бит_НастройкиУчета[ИмяНастройки][Реквизит];
КонецФункции

#КонецОбласти
