#Область ШлюзПодписок

Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	ИмяФормы = ЭтаФорма.ИмяФормы;
	ИмяСобытия = "ПриСозданииНаСервере";
	ПараметрыОбработчика = "ЭтаФорма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры";
	
	Обработчик = бит_СобытияПовтИсп.ПолучитьОбработчикСобытияФормы(ИмяСобытия, ИмяФормы);
	
	Если Обработчик <> Неопределено Тогда
		Попытка
			Выполнить(Обработчик + "(" + ПараметрыОбработчика + ")");
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Обработчик + "(" + ПараметрыОбработчика + ")";
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияФорм_Справочники

#Область ПриСозданииНаСервере_Справочники

//ПРИМЕР
//Процедура ПриСозданииНаСервере_СправочникОборудование_ФормаЭлементаУпр(ЭтаФорма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено)
//	
//	Элементы = ЭтаФорма.Элементы;
//	Команды = ЭтаФорма.Команды;
//	Объект = ЭтаФорма.Объект;
//	
//	Элемент = ДобавитьЭлемент(Элементы, "бит_НомерКабинета", Тип("ПолеФормы"), Элементы.ГруппаПодвал,,
//		Новый Структура("ПутьКДанным, Вид", "Объект.бит_НомерКабинета", ВидПоляФормы.ПолеВвода));
//	
//КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьЭлемент(Элементы, Имя, Тип, Родитель = Неопределено, ВставитьПеред = Неопределено, Свойства = Неопределено)
	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура;
	КонецЕсли;
	Элемент = Элементы.Вставить(Имя, Тип, Родитель, ВставитьПеред);
	ЗаполнитьЗначенияСвойств(Элемент, Свойства);
	Возврат Элемент;
КонецФункции

Функция СкопироватьЭлемент(Элементы, КопируемыйЭлемент, Имя, Тип, Родитель = Неопределено, ВставитьПеред = Неопределено, Свойства = Неопределено)
	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура;
	КонецЕсли;
	Элемент = Элементы.Вставить(Имя, Тип, Родитель, ВставитьПеред);
	ЗаполнитьЗначенияСвойств(Элемент, КопируемыйЭлемент,, "ВыделенныйТекст, ПутьКДанным");
	ЗаполнитьЗначенияСвойств(Элемент, Свойства);
	Возврат Элемент;
КонецФункции

Функция ДобавитьКоманду(Команды, Имя, Свойства = Неопределено)
	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура;
	КонецЕсли;
	Команда = Команды.Добавить(Имя);
	ЗаполнитьЗначенияСвойств(Команда, Свойства);
	Возврат Команда;
КонецФункции

#КонецОбласти