Функция ДобавитьЭлемент(Элементы, Имя, Тип, Родитель = Неопределено, ВставитьПеред = Неопределено, Свойства = Неопределено) Экспорт

	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура;
	КонецЕсли;

	Элемент = Элементы.Вставить(Имя, Тип, Родитель, ВставитьПеред);
	ЗаполнитьЗначенияСвойств(Элемент, Свойства);

	Возврат Элемент;
	
КонецФункции

Функция СкопироватьЭлемент(Элементы, КопируемыйЭлемент, Имя, Тип, Родитель = Неопределено, ВставитьПеред = Неопределено, Свойства = Неопределено) Экспорт

	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура;
	КонецЕсли;

	Элемент = Элементы.Вставить(Имя, Тип, Родитель, ВставитьПеред);
	ЗаполнитьЗначенияСвойств(Элемент, КопируемыйЭлемент,, "ВыделенныйТекст, ПутьКДанным");
	ЗаполнитьЗначенияСвойств(Элемент, Свойства);

	Возврат Элемент;
	
КонецФункции

Функция ДобавитьКоманду(Команды, Имя, Свойства = Неопределено) Экспорт

	Если Свойства = Неопределено Тогда
		Свойства = Новый Структура;
	КонецЕсли;

	Команда = Команды.Добавить(Имя);
	ЗаполнитьЗначенияСвойств(Команда, Свойства);

	Возврат Команда;
	
КонецФункции

// Функция - Дополнительные параметры формы
//
// Параметры:
//  СуффиксСобытия - Строка	- при формировании имени процедуры по имени события и формы, вставляется после имени события,
//							например, ПриСозданииНаСервере%1_ДокументРеализацияТоваровУслуг_ФормаДокумента, вставится вместо %1 
// 
// Возвращаемое значение:
//  Структура - Возвращает структуру для передачи в любое событие из модулей бит_События*
//
Функция ДополнительныеПараметрыФормы(СуффиксСобытия = "") Экспорт
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СуффиксСобытия", СуффиксСобытия);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции