#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить обработчик события формы
//
// Параметры:
//  ИмяСобытия	 - Строка	 - Событие формы
//  ИмяФормы	 - Строка	 - Имя формы
// 
// Возвращаемое значение:
//   Строка - Возвращается имя обработчика формы для выполнения 
//
Функция ПолучитьОбработчикСобытияФормы(ИмяСобытия, ИмяФормы, СуффиксСобытия = "") Экспорт
	
	Шаблон =  СтрШаблон("%1%2_%3", ИмяСобытия, СуффиксСобытия, "%1");
	Возврат СформироватьОбработчик(Шаблон, ИмяФормы);
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

Функция СформироватьОбработчик(Шаблон, ИмяФормы)
	
	ИмяФормы = СтрЗаменить(ИмяФормы, ".Форма.", "_");
	ИмяФормы = СтрЗаменить(ИмяФормы, ".", "");
	Возврат СтрШаблон(Шаблон, ИмяФормы);
	
КонецФункции

#КонецОбласти