#Область ПрограммныйИнтерфейс

// Возвращает строку без символов переноса строки.
// Применяется, если надо получить из исходной строки, строку с удаленными символами переноса строки.
// Например, чтобы получить длинный текст сообщения. 
//
// Параметры:
//  ИсходнаяСтрока - Строка - Исходная строка, из которой будут удалены символы переноса строки.
//
// Возвращаемое значение:
//  Строка - Строка без символов переноса строки.  
//
Функция СтрокаБезСимволовПереноса(ИсходнаяСтрока) Экспорт

	Возврат СтрЗаменить(ИсходнаяСтрока, Символы.ПС, "");

КонецФункции

#КонецОбласти
