#Область ШлюзПодписок

Процедура ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник) Экспорт
	ИмяФормы = ЭтаФорма.ИмяФормы;
	ИмяСобытияФормы = "ОбработкаОповещения";
	ПараметрыОбработчика = "ЭтаФорма, ИмяСобытия, Параметр, Источник";
	
	Обработчик = бит_СобытияПовтИсп.ПолучитьОбработчикСобытияФормы(ИмяСобытияФормы, ИмяФормы);
	
	Если Обработчик <> Неопределено Тогда
		Выполнить(Обработчик + "(" + ПараметрыОбработчика + ")");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СобытияФорм_Отчеты

#Область ОбработкаОповещения_Отчеты

//ПРИМЕР
//Процедура ОбработкаОповещения_ОтчетКалендарьПланирования_ФормаОтчетаУпр(ЭтаФорма, ИмяСобытия, Параметр, Источник)
//	Отчет = ЭтаФорма.Отчет;
//	
//	Если ИмяСобытия = "бит_ПросмотрРасписания" Тогда
//		ЗаполнитьЗначенияСвойств(Отчет, Параметр);
//		ЭтаФорма.Клиент = Параметр.Клиент;
//		ЭтаФорма.бит_ПослеОбработкиОповещения();
//	КонецЕсли;
//				
//КонецПроцедуры

#КонецОбласти

#КонецОбласти