#Область ПрограммныйИнтерфейс

// Возвращает значение константы по указанному идентификатору.
//
// Параметры:
//  Идентификатор  - Строка - Идентификатор константы.
//  Разрез  - РегистрыСведений.бит_ЗначенияНастроекУчета.Разрез.Тип - Разрез значения константы (необязательный).
//
// Возвращаемое значение:
//   Произвольный - Значение константы.
//
Функция ЗначениеКонстанты(Идентификатор, Разрез = Неопределено) Экспорт
	Возврат РегистрыСведений.бит_ЗначенияНастроекУчета.ЗначениеКонстанты(Идентификатор, Разрез);
КонецФункции

// Возвращает значения констант по указанным идентификаторам.
//
// Параметры:
//  ИдентификаторыСтрокой  - Строка - Идентификаторы констант строкой, разделенные ", ".
//
// Возвращаемое значение:
//   Структура:
//     * Ключ - Идентификатор константы.
//     * Значение - Произвольный - Значение константы.
//
Функция ЗначенияКонстант(ИдентификаторыСтрокой) Экспорт
	Возврат РегистрыСведений.бит_ЗначенияНастроекУчета.ЗначенияКонстант(ИдентификаторыСтрокой);
КонецФункции

// Возвращает признак - используется ли функциональная опция.
//  Под функциональной опцией здесь понимаем дополнительные константы с типом значения "Булево".
//  Считается, что Функциональная опция используется, в случае, если найдено 
//  хотя бы одно значение константы, установленное в ИСТИНА.
//  Например, если константу задаем в разрезе организаций, то считаем, что
//  ФО используется, если установлено ИСТИНА хотябы по одной организации.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор константы.
//
// Возвращаемое значение:
//   Булево - Признак использования ФО.
//
Функция ФункциональнаяОпцияИспользуется(Идентификатор) Экспорт	
	Возврат РегистрыСведений.бит_ЗначенияНастроекУчета.ФункциональнаяОпцияИспользуется(Идентификатор);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание константы.
//
// Параметры:
//  Идентификатор  - Строка - Идентификатор константы.
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - Строка таблицы описания констант, в которой содержится полная информация о константе.
//   	Описание колонок строки таблицы см. в НовыйТаблицаОписанияКонстант().
//
Функция ОписаниеКонстанты(Идентификатор) Экспорт
	Возврат Справочники.бит_НастройкиУчета.ОписаниеКонстанты(Идентификатор);
КонецФункции

// Возвращает таблицу полного описания констант.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица описания констант, в которой содержится полная информация о всех актуальных константах.
//   	Описание колонок таблицы см. в Справочники.бит_НастройкиУчета.НовыйТаблицаОписанияКонстант().
Функция ТаблицаОписанияКонстант() Экспорт
	Возврат Справочники.бит_НастройкиУчета.ТаблицаОписанияКонстант();
КонецФункции

#КонецОбласти

