// Функция - Получить обработчик события формы
//
// Параметры:
//  ИмяСобытия	 - Строка	 - Событие формы
//  ИмяФормы	 - Строка	 - Имя формы
// 
// Возвращаемое значение:
//   Строка - Возвращается имя обработчика формы для выполнения 
//
&НаСервере
Функция ПолучитьОбработчикСобытияФормыСервер(ИмяСобытия, ИмяФормы) Экспорт
	Шаблон =  СтрШаблон("%1_%2", ИмяСобытия, "%1");
	Возврат СформироватьОбработчик(Шаблон, ИмяФормы);
КонецФункции

// Функция - Получить обработчик события формы клиент
//
// Параметры:
//  ИмяСобытия	 - Строка	 - Событие формы
//  ИмяФормы	 - Строка	 - Имя формы
// 
// Возвращаемое значение:
//   Строка - Возвращается имя обработчика формы для выполнения 
//
&НаКлиенте
Функция ПолучитьОбработчикСобытияФормыКлиент(ИмяСобытия, ИмяФормы) Экспорт
	Шаблон =  СтрШаблон("%1_%2", ИмяСобытия, "%1");
	Возврат СформироватьОбработчик(Шаблон, ИмяФормы);
КонецФункции

Функция СформироватьОбработчик(Шаблон, ИмяФормы)
	
	ИмяФормы = СтрЗаменить(ИмяФормы, ".Форма.", "_");
	ИмяФормы = СтрЗаменить(ИмяФормы, ".", "");
	Возврат СтрШаблон(Шаблон, ИмяФормы);
	
КонецФункции
