// Функция - Получить обработчик события формы
//
// Параметры:
//  ИмяСобытия	 - Строка	 - Событие формы
//  ИмяФормы	 - Строка	 - Имя формы
// 
// Возвращаемое значение:
//   Строка - Возвращается имя обработчика формы для выполнения 
//
&НаСервере
Функция ПолучитьОбработчикСобытияФормыСервер(ИмяСобытия, ИмяФормы) Экспорт
	СоответствиеСобытий = Новый Соответствие;
	СоответствиеСобытий.Вставить("ПриСозданииНаСервере", ПолучитьОбработчикиПриСозданииНаСервере());

	СоответствиеСобытия = СоответствиеСобытий.Получить(ИмяСобытия);
	Если СоответствиеСобытия <> Неопределено Тогда
		Возврат СоответствиеСобытия.Получить(ИмяФормы);	
	КонецЕсли;
КонецФункции

// Функция - Получить обработчик события формы клиент
//
// Параметры:
//  ИмяСобытия	 - Строка	 - Событие формы
//  ИмяФормы	 - Строка	 - Имя формы
// 
// Возвращаемое значение:
//   Строка - Возвращается имя обработчика формы для выполнения 
//
&НаКлиенте
Функция ПолучитьОбработчикСобытияФормыКлиент(ИмяСобытия, ИмяФормы) Экспорт
	СоответствиеСобытий = Новый Соответствие;
	СоответствиеСобытий.Вставить("ОбработкаОповещения", ПолучитьОбработчикиОбработкаОповещения());

	СоответствиеСобытия = СоответствиеСобытий.Получить(ИмяСобытия);
	Если СоответствиеСобытия <> Неопределено Тогда
		Возврат СоответствиеСобытия.Получить(ИмяФормы);	
	КонецЕсли;
КонецФункции


// Функция - Получить обработчики при создании на сервере
// 
// Возвращаемое значение:
//  Соответствие - Возвращает соответствие форм и обработчиков события ПриСозданииНаСервере
//
&НаСервере
Функция ПолучитьОбработчикиПриСозданииНаСервере()
	соотСобытия = Новый Соответствие;
//	ПРИМЕР	
//	соотСобытия.Вставить("Справочник.Оборудование.Форма.ФормаЭлементаУпр", 	"ПриСозданииНаСервере_СправочникОборудование_ФормаЭлементаУпр");
	Возврат соотСобытия;	
КонецФункции

// Функция - Получить обработчики оповещения
// 
// Возвращаемое значение:
//  Соответствие - Возвращает соответствие форм и обработчиков события ПриСозданииНаСервере
//
&НаКлиенте
Функция ПолучитьОбработчикиОбработкаОповещения()
	соотСобытия = Новый Соответствие;
//	ПРИМЕР	
//	соотСобытия.Вставить("Отчет.КалендарьПланирования.Форма.ФормаОтчетаУпр", "ОбработкаОповещения_ОтчетКалендарьПланирования_ФормаОтчетаУпр");
	Возврат соотСобытия;	
КонецФункции


