
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеВыполнятьПроверки")
		И ДополнительныеСвойства.НеВыполнятьПроверки Тогда
		
		Возврат;
	КонецЕсли;
	
	ПроверитьКорректностьИдентификатора(Отказ);
	ПроверитьУникальностьИдентификатора(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьКорректностьИдентификатора(Отказ)

	Если ПустаяСтрока(Идентификатор) Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеКонстанты = бит_ОбщегоНазначенияПолныеПрава.ОписаниеКонстанты(Идентификатор);
	
	Если ОписаниеКонстанты = Неопределено Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru='Запись константы с неизвестным идентификатором %1'"), Идентификатор);
				
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			?(ЭтоНовый(), ЭтотОбъект, Ссылка),
			"Идентификатор",
			, // ПутьКДанным
			Отказ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьУникальностьИдентификатора(Отказ)
	
	Если ПустаяСтрока(Идентификатор) Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	бит_НастройкиУчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиУчета КАК бит_НастройкиУчета
	|ГДЕ
	|	бит_НастройкиУчета.Ссылка <> &Ссылка
	|	И бит_НастройкиУчета.Идентификатор = &Идентификатор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru='Запись константы с неуникальным идентификатором %1'"), Идентификатор);
		
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки,
			?(ЭтоНовый(), ЭтотОбъект, Ссылка),
			"Идентификатор",
			, // ПутьКДанным
			Отказ);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли